Documents/УправлениеТарифами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УправлениеТарифами</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТарифыУслугПодробно</xr:Item>
				<xr:Item>InformationRegister.Тарифы</xr:Item>
				<xr:Item>InformationRegister.ТарифыПороговые</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Тарифы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифаПоНорме</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСтимулирующегоТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСтимулирующегоТарифаПоНорме</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифаЛьгота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифаПоНормеЛьгота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТарифыУслугПодробно</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УслугаПодробно</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиСДПТПодробно</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСтимулирующегоТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифаЛьгота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТарифыПороговые</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порог</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПорога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСтимулирующегоТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Тарифы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>Тарифы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаПоНорме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифаПоНорме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаПоНормеЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифаЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТарифыПороговые.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ТарифыПороговые</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТарифыУслугПодробно.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ТарифыУслугПодробно</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаПодробно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиСДПТПодробно</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыТарифов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дневной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ночной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиковый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УправлениеТарифами/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

// Процедура - получает таблицу услуг.
//
&НаСервере
Процедура ПолучитьТаблицуУслуг(Период, Организация, Здание)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) или НЕ ЗначениеЗаполнено(Объект.Здание) Тогда
		Возврат;
	КонецЕсли;
	
	Дерево = РеквизитФормыВЗначение("ТарифыУслуг");
	Дерево.Строки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Услуги.ВидУслуги КАК ВидУслуги,
	|	Услуги.Ссылка КАК Услуга,
	|	Услуги.ПороговыйМетод,
	|	Услуги.КоличествоПорогов,
	|	ПорогиТарифовУслуг.Ссылка КАК Порог,
	|	ПорогиТарифовУслуг.Порядок,
	|	ЕСТЬNULL(УслугиВидыТарифов.ВидТарифа, ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Общий)) КАК ВидТарифа
	|ПОМЕСТИТЬ ВременнаяТаблицаУслуги
	|ИЗ
	|	Перечисление.ПорогиТарифовУслуг КАК ПорогиТарифовУслуг,
	|	Справочник.Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Услуги.ВидыТарифов КАК УслугиВидыТарифов
	|		ПО Услуги.Ссылка = УслугиВидыТарифов.Ссылка
	|ГДЕ
	|	Услуги.ЭтоГруппа = ЛОЖЬ
	|	И Услуги.ПометкаУдаления = ЛОЖЬ
	|	И Услуги.Предопределенный = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА Услуги.КоличествоПорогов = 0
	|				ТОГДА Услуги.КоличествоПорогов = ПорогиТарифовУслуг.Порядок
	|			ИНАЧЕ Услуги.КоличествоПорогов > ПорогиТарифовУслуг.Порядок
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УправлениеТарифамиТарифы.ЗначениеТарифа,
	|	УправлениеТарифамиТарифы.ВидТарифа,
	|	УправлениеТарифамиТарифы.НормаПотребления,
	|	УправлениеТарифамиТарифы.ЗначениеТарифаПоНорме,
	|	УправлениеТарифамиТарифы.ЗначениеСтимулирующегоТарифа,
	|	УправлениеТарифамиТарифы.ЗначениеСтимулирующегоТарифаПоНорме,
	|	УправлениеТарифамиТарифы.Услуга,
	|	УправлениеТарифамиТарифы.ЗначениеТарифаЛьгота,
	|	УправлениеТарифамиТарифы.ЗначениеТарифаПоНормеЛьгота
	|ПОМЕСТИТЬ втУправлениеТарифами
	|ИЗ
	|	Документ.УправлениеТарифами.Тарифы КАК УправлениеТарифамиТарифы
	|ГДЕ
	|	УправлениеТарифамиТарифы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УправлениеТарифамиТарифыПороговые.ВидТарифа,
	|	УправлениеТарифамиТарифыПороговые.Порог,
	|	УправлениеТарифамиТарифыПороговые.Услуга,
	|	УправлениеТарифамиТарифыПороговые.ЗначениеПорога,
	|	УправлениеТарифамиТарифыПороговые.ЗначениеТарифа,
	|	УправлениеТарифамиТарифыПороговые.ЗначениеСтимулирующегоТарифа
	|ПОМЕСТИТЬ втУправлениеТарифамиПороговые
	|ИЗ
	|	Документ.УправлениеТарифами.ТарифыПороговые КАК УправлениеТарифамиТарифыПороговые
	|ГДЕ
	|	УправлениеТарифамиТарифыПороговые.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаУслуги.ВидУслуги КАК ВидУслуги,
	|	ВременнаяТаблицаУслуги.Услуга КАК Услуга,
	|	ВременнаяТаблицаУслуги.ВидТарифа КАК ВидТарифа,
	|	ВременнаяТаблицаУслуги.Порог,
	|	ВременнаяТаблицаУслуги.КоличествоПорогов,
	|	ВременнаяТаблицаУслуги.Услуга.Родитель КАК Родитель,
	|	ВременнаяТаблицаУслуги.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаУслуги.Услуга.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоНормамПотребления)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПоНормеПотребления,
	|	ТарифыСрезПоследних.Период КАК ДатаЗначения,
	|	ЕСТЬNULL(ТарифыСрезПоследних.ЗначениеТарифа, 0) КАК ЗначениеТарифаПредыдущее,
	|	ЕСТЬNULL(ТарифыСрезПоследних.ЗначениеСтимулирующегоТарифа, 0) КАК ЗначениеСтимулирующегоТарифаПредыдущее,
	|	ЕСТЬNULL(ТарифыСрезПоследних.НормаПотребления, 0) КАК НормаПотребленияПредыдущее,
	|	ЕСТЬNULL(ТарифыСрезПоследних.ЗначениеТарифаПоНорме, 0) КАК ЗначениеТарифаПоНормеПредыдущее,
	|	ЕСТЬNULL(ТарифыСрезПоследних.ЗначениеСтимулирующегоТарифаПоНорме, 0) КАК ЗначениеСтимулирующегоТарифаПоНормеПредыдущее,
	|	ЕСТЬNULL(ТарифыПороговыеСрезПоследних.ЗначениеТарифа, 0) КАК ЗначениеТарифаПороговогоПредыдущее,
	|	ЕСТЬNULL(ТарифыПороговыеСрезПоследних.ЗначениеПорога, 0) КАК ЗначениеПорогаПредыдущее,
	|	ТарифыПороговыеСрезПоследних.Период КАК ДатаЗначенияПорогового,
	|	ЕСТЬNULL(втУправлениеТарифами.ЗначениеТарифа, 0) КАК ЗначениеТарифа,
	|	ЕСТЬNULL(втУправлениеТарифами.НормаПотребления, 0) КАК НормаПотребления,
	|	ЕСТЬNULL(втУправлениеТарифами.ЗначениеТарифаПоНорме, 0) КАК ЗначениеТарифаПоНорме,
	|	ЕСТЬNULL(втУправлениеТарифами.ЗначениеСтимулирующегоТарифа, 0) КАК ЗначениеСтимулирующегоТарифа,
	|	ЕСТЬNULL(втУправлениеТарифами.ЗначениеСтимулирующегоТарифаПоНорме, 0) КАК ЗначениеСтимулирующегоТарифаПоНорме,
	|	ЕСТЬNULL(втУправлениеТарифамиПороговые.ЗначениеПорога, 0) КАК ЗначениеПорога,
	|	ЕСТЬNULL(втУправлениеТарифамиПороговые.ЗначениеТарифа, 0) КАК ЗначениеТарифаПорогового,
	|	ЕСТЬNULL(ТарифыПороговыеСрезПоследних.ЗначениеСтимулирующегоТарифа, 0) КАК ЗначениеСтимулирующегоТарифаПороговогоПредыдущее,
	|	ЕСТЬNULL(втУправлениеТарифамиПороговые.ЗначениеСтимулирующегоТарифа, 0) КАК ЗначениеСтимулирующегоТарифаПорогового,
	|	ЕСТЬNULL(втУправлениеТарифами.ЗначениеТарифаЛьгота, 0) КАК ЗначениеТарифаЛьгота,
	|	ЕСТЬNULL(втУправлениеТарифами.ЗначениеТарифаПоНормеЛьгота, 0) КАК ЗначениеТарифаПоНормеЛьгота,
	|	ЕСТЬNULL(ТарифыСрезПоследних.ЗначениеТарифаЛьгота, 0) КАК ЗначениеТарифаЛьготаПредыдущее,
	|	ЕСТЬNULL(ТарифыСрезПоследних.ЗначениеТарифаПоНормеЛьгота, 0) КАК ЗначениеТарифаПоНормеЛьготаПредыдущее
	|ИЗ
	|	ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Тарифы.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Здание = &Здание) КАК ТарифыСрезПоследних
	|		ПО ВременнаяТаблицаУслуги.Услуга = ТарифыСрезПоследних.Услуга
	|			И ВременнаяТаблицаУслуги.ВидТарифа = ТарифыСрезПоследних.ВидТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыПороговые.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Здание = &Здание) КАК ТарифыПороговыеСрезПоследних
	|		ПО ВременнаяТаблицаУслуги.Услуга = ТарифыПороговыеСрезПоследних.Услуга
	|			И ВременнаяТаблицаУслуги.Порог = ТарифыПороговыеСрезПоследних.Порог
	|			И ВременнаяТаблицаУслуги.ВидТарифа = ТарифыПороговыеСрезПоследних.ВидТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ втУправлениеТарифами КАК втУправлениеТарифами
	|		ПО ВременнаяТаблицаУслуги.Услуга = втУправлениеТарифами.Услуга
	|			И ВременнаяТаблицаУслуги.ВидТарифа = втУправлениеТарифами.ВидТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ втУправлениеТарифамиПороговые КАК втУправлениеТарифамиПороговые
	|		ПО ВременнаяТаблицаУслуги.Услуга = втУправлениеТарифамиПороговые.Услуга
	|			И ВременнаяТаблицаУслуги.Порог = втУправлениеТарифамиПороговые.Порог
	|			И ВременнаяТаблицаУслуги.ВидТарифа = втУправлениеТарифамиПороговые.ВидТарифа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВременнаяТаблицаУслуги.Услуга.Родитель.Код,
	|	ВременнаяТаблицаУслуги.Услуга.Код,
	|	ВременнаяТаблицаУслуги.Порог.Порядок
	|ИТОГИ ПО
	|	Родитель,
	|	Услуга,
	|	ВидТарифа";
	
	Запрос.УстановитьПараметр("Период", Период - 24*60*60);
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ВыборкаРодитель = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРодитель.Следующий() Цикл
		СтрокаУровень1 = Дерево.Строки.Добавить();
		СтрокаУровень1.Услуга = ВыборкаРодитель.Родитель;
		СтрокаУровень1.ЭтоГруппа = Истина;
		
		ВыборкаУслуга = ВыборкаРодитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаУслуга.Следующий() Цикл
			
			ВыборкаВидТарифа = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаВидТарифа.Следующий() Цикл
				СтрокаУровень2= СтрокаУровень1.Строки.Добавить();
				СтрокаУровень2.Услуга = ВыборкаУслуга.Услуга;
				СтрокаУровень2.ЕдиницаИзмерения = ВыборкаУслуга.ЕдиницаИзмерения;
				СтрокаУровень2.ПоНормеПотребления = ВыборкаУслуга.ПоНормеПотребления;
				СтрокаУровень2.ВидТарифа = ВыборкаВидТарифа.ВидТарифа;
				
				//ВыборкаДетальные = ВыборкаУслуга.Выбрать();
				ВыборкаДетальные = ВыборкаВидТарифа.Выбрать();
				
				Если ВыборкаДетальные.Количество() = 1 Тогда
					ВыборкаДетальные.Следующий();
					
					СтрокаУровень2.ТарифПредыдущий = ВыборкаДетальные.ЗначениеТарифаПредыдущее;
					СтрокаУровень2.ДатаПредыдущая = ВыборкаДетальные.ДатаЗначения;
					СтрокаУровень2.НормаПотребленияПредыдущая = ВыборкаДетальные.НормаПотребленияПредыдущее;
					СтрокаУровень2.ТарифПоНормеПредыдущий = ВыборкаДетальные.ЗначениеТарифаПоНормеПредыдущее;
					СтрокаУровень2.ТарифПредыдущийЛьгота = ВыборкаДетальные.ЗначениеТарифаЛьготаПредыдущее;
					СтрокаУровень2.ТарифПоНормеПредыдущийЛьгота = ВыборкаДетальные.ЗначениеТарифаПоНормеЛьготаПредыдущее;
					
					СтрокаУровень2.ТарифСтимулирующийПредыдущий = ВыборкаДетальные.ЗначениеСтимулирующегоТарифаПредыдущее;
					СтрокаУровень2.ТарифСтимулирующийПоНормеПредыдущий = ВыборкаДетальные.ЗначениеСтимулирующегоТарифаПоНормеПредыдущее;
					
					СтрокаУровень2.Тариф = ВыборкаДетальные.ЗначениеТарифа;
					СтрокаУровень2.ТарифПоНорме = ВыборкаДетальные.ЗначениеТарифаПоНорме;
					СтрокаУровень2.ТарифЛьгота = ?(ВыборкаДетальные.ЗначениеТарифаЛьгота = 0, ВыборкаДетальные.ЗначениеТарифа, ВыборкаДетальные.ЗначениеТарифаЛьгота);
					СтрокаУровень2.ТарифПоНормеЛьгота = ?(ВыборкаДетальные.ЗначениеТарифаПоНормеЛьгота = 0, ВыборкаДетальные.ЗначениеТарифаПоНорме, ВыборкаДетальные.ЗначениеТарифаПоНормеЛьгота);
					СтрокаУровень2.НормаПотребления = ВыборкаДетальные.НормаПотребления;
					
					СтрокаУровень2.ТарифСтимулирующий = ВыборкаДетальные.ЗначениеСтимулирующегоТарифа;
					СтрокаУровень2.ТарифСтимулирующийПоНорме = ВыборкаДетальные.ЗначениеСтимулирующегоТарифаПоНорме;
					
					Если ЭтоНовый Тогда
						СтрокаУровень2.Тариф = СтрокаУровень2.ТарифПредыдущий;
						СтрокаУровень2.НормаПотребления = СтрокаУровень2.НормаПотребленияПредыдущая;
						СтрокаУровень2.ТарифПоНорме = СтрокаУровень2.ТарифПоНормеПредыдущий;
						
						СтрокаУровень2.ТарифЛьгота = СтрокаУровень2.ТарифПредыдущий;
						СтрокаУровень2.ТарифПоНормеЛьгота = СтрокаУровень2.ТарифПоНормеПредыдущий;

						
						СтрокаУровень2.ТарифСтимулирующий = СтрокаУровень2.ТарифСтимулирующийПредыдущий;
						СтрокаУровень2.ТарифСтимулирующийПоНорме = СтрокаУровень2.ТарифСтимулирующийПоНормеПредыдущий;
						
					КонецЕсли;
					
				Иначе
					ПредПорог = 0;
					ТарифСтр = "";
					ТарифСтимулирующийСтр = "";
					
					Пока ВыборкаДетальные.Следующий() Цикл
						СтрокаУровень3= СтрокаУровень2.Строки.Добавить();
						
						СтрокаУровень2.УслугаПороговая = Истина;
						СтрокаУровень2.ВидТарифа = ВыборкаДетальные.ВидТарифа;
						СтрокаУровень3.УслугаРодитель = СтрокаУровень2.Услуга;
						СтрокаУровень3.ЭтоПорог = Истина;
						
						СтрокаУровень3.Порог = ВыборкаДетальные.Порог;
						СтрокаУровень3.ДатаПредыдущая = ВыборкаДетальные.ДатаЗначенияПорогового;
						СтрокаУровень3.ТарифПредыдущий = ВыборкаДетальные.ЗначениеТарифаПороговогоПредыдущее;
						СтрокаУровень3.ТарифСтимулирующийПредыдущий = ВыборкаДетальные.ЗначениеСтимулирующегоТарифаПороговогоПредыдущее;
						СтрокаУровень3.ЗначениеПорогаПредыдущее = ВыборкаДетальные.ЗначениеПорогаПредыдущее;
						СтрокаУровень3.ТарифПредыдущийЛьгота = ВыборкаДетальные.ЗначениеТарифаЛьготаПредыдущее;
						СтрокаУровень3.ТарифПоНормеПредыдущийЛьгота = ВыборкаДетальные.ЗначениеТарифаПоНормеЛьготаПредыдущее;
						
						СтрокаУровень3.Тариф = ВыборкаДетальные.ЗначениеТарифаПорогового;
						СтрокаУровень3.ТарифСтимулирующий = ВыборкаДетальные.ЗначениеСтимулирующегоТарифаПорогового;
						СтрокаУровень3.ЗначениеПорога = ВыборкаДетальные.ЗначениеПорога;
						
						
						
						Если ЭтоНовый Тогда
							СтрокаУровень3.Тариф = СтрокаУровень3.ТарифПредыдущий;
							СтрокаУровень3.ЗначениеПорога = СтрокаУровень3.ЗначениеПорогаПредыдущее;
							СтрокаУровень3.ТарифСтимулирующий = СтрокаУровень3.ТарифСтимулирующийПредыдущий;
							
						КонецЕсли;
						
						Если ПредПорог = 0 Тогда
							НаимПорога = НСтр("ru='За объем до %1 %2 включительно в месяц';uk='За обсяг до %1 %2 включно на місяць'");
						ИначеЕсли ВыборкаДетальные.ЗначениеПорога < 1000000 Тогда
							НаимПорога = НСтр("ru='За объем свыше %3 %2 до %1 %2 включительно в месяц';uk='За обсяг понад %3 %2 до %1 %2 включно на місяць'");
						Иначе
							НаимПорога = НСтр("ru='За объем свыше %3 %2 в месяц';uk='За обсяг понад %3 %2 на місяць'");
						КонецЕсли;
						
						НаимПорога = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НаимПорога,
						СтрокаУровень3.ЗначениеПорога,
						ВыборкаДетальные.ЕдиницаИзмерения,
						ПредПорог);
						
						СтрокаУровень3.Услуга = НаимПорога;
						
						ПредПорог = СтрокаУровень3.ЗначениеПорога;
						
						ТарифСтр = ТарифСтр + Строка(СтрокаУровень3.Тариф)+"\";
						ТарифСтимулирующийСтр = ТарифСтимулирующийСтр + Строка(СтрокаУровень3.ТарифСтимулирующий)+"\";
						
					КонецЦикла; 
					
					СтрокаУровень2.Тариф = ТарифСтр;
					СтрокаУровень2.ТарифСтимулирующий = ТарифСтимулирующийСтр;
					
				КонецЕсли; 
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла; 
	
	ЭтаФорма.ЗначениеВРеквизитФормы(Дерево, "ТарифыУслуг");
	
	
КонецПроцедуры

// Процедура - получает таблицу услуг подробно.
//
&НаСервере
Процедура ПолучитьТаблицуУслугПодробно(Период, Организация, Здание)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) или НЕ ЗначениеЗаполнено(Объект.Здание) Тогда
		Возврат;
	КонецЕсли;
	
	Дерево = РеквизитФормыВЗначение("ТарифыУслуг");
	Дерево.Строки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Услуги.ВидУслуги КАК ВидУслуги,
	|	Услуги.Ссылка КАК Услуга,
	|	Услуги.ПороговыйМетод,
	|	Услуги.КоличествоПорогов,
	|	ПорогиТарифовУслуг.Ссылка КАК Порог,
	|	ПорогиТарифовУслуг.Порядок,
	|	УслугиСДПТПодробно.Ссылка КАК УслугаПодробно,
	|	ЕСТЬNULL(УслугиВидыТарифов.ВидТарифа, ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Общий)) КАК ВидТарифа
	|ПОМЕСТИТЬ ВременнаяТаблицаУслуги
	|ИЗ
	|	Перечисление.ПорогиТарифовУслуг КАК ПорогиТарифовУслуг,
	|	Справочник.Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиСДПТПодробно КАК УслугиСДПТПодробно
	|		ПО (Услуги.ВидУслуги = ЗНАЧЕНИЕ(Справочник.ВидыУслуг.СДПТ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Услуги.ВидыТарифов КАК УслугиВидыТарифов
	|		ПО (УслугиВидыТарифов.Ссылка = Услуги.Ссылка)
	|ГДЕ
	|	Услуги.ЭтоГруппа = ЛОЖЬ
	|	И Услуги.ПометкаУдаления = ЛОЖЬ
	|	И Услуги.Предопределенный = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА Услуги.КоличествоПорогов = 0
	|				ТОГДА Услуги.КоличествоПорогов = ПорогиТарифовУслуг.Порядок
	|			ИНАЧЕ Услуги.КоличествоПорогов > ПорогиТарифовУслуг.Порядок
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УправлениеТарифамиТарифы.ЗначениеТарифа,
	|	УправлениеТарифамиТарифы.ВидТарифа,
	|	УправлениеТарифамиТарифы.НормаПотребления,
	|	УправлениеТарифамиТарифы.ЗначениеТарифаПоНорме,
	|	УправлениеТарифамиТарифы.ЗначениеСтимулирующегоТарифа,
	|	УправлениеТарифамиТарифы.ЗначениеСтимулирующегоТарифаПоНорме,
	|	УправлениеТарифамиТарифы.Услуга,
	|	УправлениеТарифамиТарифы.ЗначениеТарифаЛьгота,
	|	УправлениеТарифамиТарифы.ЗначениеТарифаПоНормеЛьгота
	|ПОМЕСТИТЬ втУправлениеТарифами
	|ИЗ
	|	Документ.УправлениеТарифами.Тарифы КАК УправлениеТарифамиТарифы
	|ГДЕ
	|	УправлениеТарифамиТарифы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УправлениеТарифамиТарифыУслугПодробно.Услуга,
	|	УправлениеТарифамиТарифыУслугПодробно.УслугаПодробно,
	|	УправлениеТарифамиТарифыУслугПодробно.ЗначениеТарифа,
	|	УправлениеТарифамиТарифыУслугПодробно.ЗначениеСтимулирующегоТарифа,
	|	УправлениеТарифамиТарифыУслугПодробно.ЗначениеТарифаЛьгота КАК ЗначениеТарифаЛьготаПодробно,
	|	УправлениеТарифамиТарифыУслугПодробно.ВидТарифа
	|ПОМЕСТИТЬ втУправлениеТарифамиПодробно
	|ИЗ
	|	Документ.УправлениеТарифами.ТарифыУслугПодробно КАК УправлениеТарифамиТарифыУслугПодробно
	|ГДЕ
	|	УправлениеТарифамиТарифыУслугПодробно.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УправлениеТарифамиТарифыПороговые.ВидТарифа,
	|	УправлениеТарифамиТарифыПороговые.Порог,
	|	УправлениеТарифамиТарифыПороговые.Услуга,
	|	УправлениеТарифамиТарифыПороговые.ЗначениеПорога,
	|	УправлениеТарифамиТарифыПороговые.ЗначениеТарифа,
	|	УправлениеТарифамиТарифыПороговые.ЗначениеСтимулирующегоТарифа
	|ПОМЕСТИТЬ втУправлениеТарифамиПороговые
	|ИЗ
	|	Документ.УправлениеТарифами.ТарифыПороговые КАК УправлениеТарифамиТарифыПороговые
	|ГДЕ
	|	УправлениеТарифамиТарифыПороговые.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаУслуги.ВидУслуги КАК ВидУслуги,
	|	ВременнаяТаблицаУслуги.Услуга КАК Услуга,
	|	ВременнаяТаблицаУслуги.Порог,
	|	ВременнаяТаблицаУслуги.УслугаПодробно,
	|	ВременнаяТаблицаУслуги.КоличествоПорогов,
	|	ВременнаяТаблицаУслуги.Услуга.Родитель КАК Родитель,
	|	ВременнаяТаблицаУслуги.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаУслуги.Услуга.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоНормамПотребления)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПоНормеПотребления,
	|	ТарифыСрезПоследних.Период КАК ДатаЗначения,
	|	ЕСТЬNULL(ТарифыСрезПоследних.ЗначениеТарифа, 0) КАК ЗначениеТарифаПредыдущее,
	|	ЕСТЬNULL(ТарифыСрезПоследних.ЗначениеСтимулирующегоТарифа, 0) КАК ЗначениеСтимулирующегоТарифаПредыдущее,
	|	ЕСТЬNULL(ТарифыСрезПоследних.НормаПотребления, 0) КАК НормаПотребленияПредыдущее,
	|	ЕСТЬNULL(ТарифыСрезПоследних.ЗначениеТарифаПоНорме, 0) КАК ЗначениеТарифаПоНормеПредыдущее,
	|	ЕСТЬNULL(ТарифыСрезПоследних.ЗначениеСтимулирующегоТарифаПоНорме, 0) КАК ЗначениеСтимулирующегоТарифаПоНормеПредыдущее,
	|	ЕСТЬNULL(ТарифыПороговыеСрезПоследних.ЗначениеТарифа, 0) КАК ЗначениеТарифаПороговогоПредыдущее,
	|	ЕСТЬNULL(ТарифыПороговыеСрезПоследних.ЗначениеПорога, 0) КАК ЗначениеПорогаПредыдущее,
	|	ТарифыПороговыеСрезПоследних.Период КАК ДатаЗначенияПорогового,
	|	ЕСТЬNULL(ТарифыУслугПодробноСрезПоследних.ЗначениеТарифа, 0) КАК ЗначениеТарифаПодробноПредыдущее,
	|	ЕСТЬNULL(ТарифыУслугПодробноСрезПоследних.ЗначениеСтимулирующегоТарифа, 0) КАК ЗначениеСтимулирующегоТарифаПодробноПредыдущее,
	|	ТарифыУслугПодробноСрезПоследних.Период КАК ДатаЗначенияПодробно,
	|	ЕСТЬNULL(втУправлениеТарифами.ЗначениеТарифа, 0) КАК ЗначениеТарифа,
	|	ЕСТЬNULL(втУправлениеТарифами.НормаПотребления, 0) КАК НормаПотребления,
	|	ЕСТЬNULL(втУправлениеТарифами.ЗначениеТарифаПоНорме, 0) КАК ЗначениеТарифаПоНорме,
	|	ЕСТЬNULL(втУправлениеТарифами.ЗначениеСтимулирующегоТарифа, 0) КАК ЗначениеСтимулирующегоТарифа,
	|	ЕСТЬNULL(втУправлениеТарифами.ЗначениеСтимулирующегоТарифаПоНорме, 0) КАК ЗначениеСтимулирующегоТарифаПоНорме,
	|	ЕСТЬNULL(втУправлениеТарифамиПодробно.ЗначениеТарифа, 0) КАК ЗначениеТарифаПодробно,
	|	ЕСТЬNULL(втУправлениеТарифамиПодробно.ЗначениеСтимулирующегоТарифа, 0) КАК ЗначениеСтимулирующегоТарифаПодробно,
	|	ЕСТЬNULL(втУправлениеТарифамиПороговые.ЗначениеПорога, 0) КАК ЗначениеПорога,
	|	ЕСТЬNULL(втУправлениеТарифамиПороговые.ЗначениеТарифа, 0) КАК ЗначениеТарифаПорогового,
	|	ЕСТЬNULL(ТарифыПороговыеСрезПоследних.ЗначениеСтимулирующегоТарифа, 0) КАК ЗначениеСтимулирующегоТарифаПороговогоПредыдущее,
	|	ЕСТЬNULL(втУправлениеТарифамиПороговые.ЗначениеСтимулирующегоТарифа, 0) КАК ЗначениеСтимулирующегоТарифаПорогового,
	|	ВременнаяТаблицаУслуги.ВидТарифа КАК ВидТарифа,
	|	ЕСТЬNULL(втУправлениеТарифами.ЗначениеТарифаЛьгота, 0) КАК ЗначениеТарифаЛьгота,
	|	ЕСТЬNULL(втУправлениеТарифами.ЗначениеТарифаПоНормеЛьгота, 0) КАК ЗначениеТарифаПоНормеЛьгота,
	|	ЕСТЬNULL(ТарифыСрезПоследних.ЗначениеТарифаЛьгота, 0) КАК ЗначениеТарифаЛьготаПредыдущее,
	|	ЕСТЬNULL(ТарифыСрезПоследних.ЗначениеТарифаПоНормеЛьгота, 0) КАК ЗначениеТарифаПоНормеЛьготаПредыдущее,
	|	ЕСТЬNULL(втУправлениеТарифамиПодробно.ЗначениеТарифаЛьготаПодробно, 0) КАК ЗначениеТарифаЛьготаПодробно,
	|	ЕСТЬNULL(ТарифыУслугПодробноСрезПоследних.ЗначениеТарифаЛьгота, 0) КАК ЗначениеТарифаЛьготаПодробноПредыдущие,
	|	ВременнаяТаблицаУслуги.ПороговыйМетод
	|ИЗ
	|	ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Тарифы.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Здание = &Здание) КАК ТарифыСрезПоследних
	|		ПО ВременнаяТаблицаУслуги.Услуга = ТарифыСрезПоследних.Услуга
	|			И ВременнаяТаблицаУслуги.ВидТарифа = ТарифыСрезПоследних.ВидТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыПороговые.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Здание = &Здание) КАК ТарифыПороговыеСрезПоследних
	|		ПО ВременнаяТаблицаУслуги.Услуга = ТарифыПороговыеСрезПоследних.Услуга
	|			И ВременнаяТаблицаУслуги.Порог = ТарифыПороговыеСрезПоследних.Порог
	|			И ВременнаяТаблицаУслуги.ВидТарифа = ТарифыПороговыеСрезПоследних.ВидТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыУслугПодробно.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Здание = &Здание) КАК ТарифыУслугПодробноСрезПоследних
	|		ПО ВременнаяТаблицаУслуги.Услуга = ТарифыУслугПодробноСрезПоследних.Услуга
	|			И ВременнаяТаблицаУслуги.УслугаПодробно = ТарифыУслугПодробноСрезПоследних.УслугаПодробно
	|		ЛЕВОЕ СОЕДИНЕНИЕ втУправлениеТарифами КАК втУправлениеТарифами
	|		ПО ВременнаяТаблицаУслуги.Услуга = втУправлениеТарифами.Услуга
	|			И ВременнаяТаблицаУслуги.ВидТарифа = втУправлениеТарифами.ВидТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ втУправлениеТарифамиПодробно КАК втУправлениеТарифамиПодробно
	|		ПО ВременнаяТаблицаУслуги.Услуга = втУправлениеТарифамиПодробно.Услуга
	|			И ВременнаяТаблицаУслуги.УслугаПодробно = втУправлениеТарифамиПодробно.УслугаПодробно
	|			И ВременнаяТаблицаУслуги.ВидТарифа = втУправлениеТарифамиПодробно.ВидТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ втУправлениеТарифамиПороговые КАК втУправлениеТарифамиПороговые
	|		ПО ВременнаяТаблицаУслуги.Услуга = втУправлениеТарифамиПороговые.Услуга
	|			И ВременнаяТаблицаУслуги.Порог = втУправлениеТарифамиПороговые.Порог
	|			И ВременнаяТаблицаУслуги.ВидТарифа = втУправлениеТарифамиПороговые.ВидТарифа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВременнаяТаблицаУслуги.Услуга.Родитель.Код,
	|	ВременнаяТаблицаУслуги.Услуга.Код,
	|	ВременнаяТаблицаУслуги.Порог.Порядок,
	|	ВременнаяТаблицаУслуги.УслугаПодробно.Код
	|ИТОГИ ПО
	|	Родитель,
	|	Услуга,
	|	ВидТарифа";
	
	Запрос.УстановитьПараметр("Период", Период - 24*60*60);
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ВыборкаРодитель = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРодитель.Следующий() Цикл
		СтрокаУровень1 = Дерево.Строки.Добавить();
		СтрокаУровень1.Услуга = ВыборкаРодитель.Родитель;
		СтрокаУровень1.ЭтоГруппа = Истина;
		
		ВыборкаУслуга = ВыборкаРодитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаУслуга.Следующий() Цикл
			ВыборкаВидТарифа = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаВидТарифа.Следующий() Цикл
				
				СтрокаУровень2= СтрокаУровень1.Строки.Добавить();
				СтрокаУровень2.Услуга = ВыборкаУслуга.Услуга;
				СтрокаУровень2.ЕдиницаИзмерения = ВыборкаУслуга.ЕдиницаИзмерения;
				СтрокаУровень2.ПоНормеПотребления = ВыборкаУслуга.ПоНормеПотребления;
				СтрокаУровень2.ВидТарифа = ВыборкаВидТарифа.ВидТарифа;
				
				//ВыборкаДетальные = ВыборкаУслуга.Выбрать();
				ВыборкаДетальные = ВыборкаВидТарифа.Выбрать();
				
				Если ВыборкаДетальные.Количество() = 1 Тогда
					ВыборкаДетальные.Следующий();	
					СтрокаУровень2.ТарифПредыдущий = ВыборкаДетальные.ЗначениеТарифаПредыдущее;
					СтрокаУровень2.ДатаПредыдущая = ВыборкаДетальные.ДатаЗначения;
					СтрокаУровень2.НормаПотребленияПредыдущая = ВыборкаДетальные.НормаПотребленияПредыдущее;
					СтрокаУровень2.ТарифПоНормеПредыдущий = ВыборкаДетальные.ЗначениеТарифаПоНормеПредыдущее;
					
					СтрокаУровень2.ТарифПредыдущийЛьгота = ВыборкаДетальные.ЗначениеТарифаЛьготаПредыдущее;
					СтрокаУровень2.ТарифПоНормеПредыдущийЛьгота = ВыборкаДетальные.ЗначениеТарифаПоНормеЛьготаПредыдущее;

					
					СтрокаУровень2.ТарифСтимулирующийПредыдущий = ВыборкаДетальные.ЗначениеСтимулирующегоТарифаПредыдущее;
					СтрокаУровень2.ТарифСтимулирующийПоНормеПредыдущий = ВыборкаДетальные.ЗначениеСтимулирующегоТарифаПоНормеПредыдущее;
					
					СтрокаУровень2.Тариф = ВыборкаДетальные.ЗначениеТарифа;
					СтрокаУровень2.ТарифПоНорме = ВыборкаДетальные.ЗначениеТарифаПоНорме;
					СтрокаУровень2.ТарифЛьгота = ?(ВыборкаДетальные.ЗначениеТарифаЛьгота = 0,ВыборкаДетальные.ЗначениеТарифа,ВыборкаДетальные.ЗначениеТарифаЛьгота);
					СтрокаУровень2.ТарифПоНормеЛьгота = ?(ВыборкаДетальные.ЗначениеТарифаПоНормеЛьгота = 0,ВыборкаДетальные.ЗначениеТарифаПоНорме,ВыборкаДетальные.ЗначениеТарифаПоНормеЛьгота);
					СтрокаУровень2.НормаПотребления = ВыборкаДетальные.НормаПотребления;
					
					СтрокаУровень2.ТарифСтимулирующий = ВыборкаДетальные.ЗначениеСтимулирующегоТарифа;
					СтрокаУровень2.ТарифСтимулирующийПоНорме = ВыборкаДетальные.ЗначениеСтимулирующегоТарифаПоНорме;
					
					Если ЭтоНовый Тогда
						СтрокаУровень2.Тариф = СтрокаУровень2.ТарифПредыдущий;
						СтрокаУровень2.НормаПотребления = СтрокаУровень2.НормаПотребленияПредыдущая;
						СтрокаУровень2.ТарифПоНорме = СтрокаУровень2.ТарифПоНормеПредыдущий;
						
						СтрокаУровень2.ТарифЛьгота = ?(ВыборкаДетальные.ЗначениеТарифаЛьготаПредыдущее = 0,СтрокаУровень2.ТарифПредыдущий,ВыборкаДетальные.ЗначениеТарифаЛьготаПредыдущее);
						СтрокаУровень2.ТарифПоНормеЛьгота = ?(ВыборкаДетальные.ЗначениеТарифаПоНормеЛьготаПредыдущее = 0,СтрокаУровень2.ТарифПоНормеПредыдущий,ВыборкаДетальные.ЗначениеТарифаПоНормеЛьготаПредыдущее);
						
						СтрокаУровень2.ТарифСтимулирующий = СтрокаУровень2.ТарифСтимулирующийПредыдущий;
						СтрокаУровень2.ТарифСтимулирующийПоНорме = СтрокаУровень2.ТарифСтимулирующийПоНормеПредыдущий;
						
					КонецЕсли;
					
				Иначе
					ПредПорог = 0;
					ТарифСтр = "";
					ТарифСтимулирующийСтр = "";
					
					Пока ВыборкаДетальные.Следующий() Цикл
						СтрокаУровень3= СтрокаУровень2.Строки.Добавить();
						
						Если ЗначениеЗаполнено(ВыборкаДетальные.УслугаПодробно) Тогда
							СтрокаУровень3.Услуга = ВыборкаДетальные.УслугаПодробно;
							СтрокаУровень3.ВидТарифа = ВыборкаВидТарифа.Видтарифа;
							СтрокаУровень2.УслугаСДПТ = Истина;
							СтрокаУровень2.СоставСДПТ = Ложь;
							
							СтрокаУровень2.ДатаПредыдущая = ВыборкаДетальные.ДатаЗначения;
							СтрокаУровень2.ТарифПредыдущий = ВыборкаДетальные.ЗначениеТарифаПредыдущее;
							СтрокаУровень2.ТарифСтимулирующийПредыдущий = ВыборкаДетальные.ЗначениеСтимулирующегоТарифаПредыдущее;
							СтрокаУровень2.Тариф = ВыборкаДетальные.ЗначениеТарифа;
							СтрокаУровень2.ТарифСтимулирующий = ВыборкаДетальные.ЗначениеСтимулирующегоТарифа;
							
							СтрокаУровень2.ТарифПредыдущийЛьгота = ВыборкаДетальные.ЗначениеТарифаЛьготаПредыдущее;
							СтрокаУровень2.ТарифПоНормеПредыдущийЛьгота = ВыборкаДетальные.ЗначениеТарифаПоНормеЛьготаПредыдущее;
							
							СтрокаУровень2.ТарифЛьгота = ВыборкаДетальные.ЗначениеТарифаЛьгота;
							СтрокаУровень2.ТарифПоНормеЛьгота = ВыборкаДетальные.ЗначениеТарифаПоНормеЛьгота;
		
							
							СтрокаУровень3.ДатаПредыдущая = ВыборкаДетальные.ДатаЗначенияПодробно;
							СтрокаУровень3.ТарифПредыдущий = ВыборкаДетальные.ЗначениеТарифаПодробноПредыдущее;
							СтрокаУровень3.ТарифПредыдущийЛьгота = ВыборкаДетальные.ЗначениеТарифаЛьготаПодробноПредыдущие;
							СтрокаУровень3.ТарифСтимулирующийПредыдущий = ВыборкаДетальные.ЗначениеСтимулирующегоТарифаПодробноПредыдущее;
							СтрокаУровень3.Тариф = ВыборкаДетальные.ЗначениеТарифаПодробно;
							СтрокаУровень3.ТарифЛьгота = ВыборкаДетальные.ЗначениеТарифаЛьготаПодробно;
							СтрокаУровень3.ТарифСтимулирующий = ВыборкаДетальные.ЗначениеСтимулирующегоТарифаПодробно;
							СтрокаУровень3.СоставСДПТ = Истина;
							Если ЭтоНовый Тогда
								СтрокаУровень3.Тариф = СтрокаУровень3.ТарифПредыдущий;
								СтрокаУровень3.ТарифСтимулирующий = СтрокаУровень3.ТарифСтимулирующийПредыдущий;
								СтрокаУровень3.ТарифЛьгота =  СтрокаУровень3.ТарифПредыдущийЛьгота;
							КонецЕсли;
							
						Иначе
							
							СтрокаУровень2.УслугаПороговая = Истина;
							СтрокаУровень2.УслугаСДПТ = Ложь;
							СтрокаУровень3.ЭтоПорог = Истина;
							
							СтрокаУровень3.Порог = ВыборкаДетальные.Порог;
							СтрокаУровень3.ДатаПредыдущая = ВыборкаДетальные.ДатаЗначенияПорогового;
							СтрокаУровень3.ТарифПредыдущий = ВыборкаДетальные.ЗначениеТарифаПороговогоПредыдущее;
							СтрокаУровень3.ТарифСтимулирующийПредыдущий = ВыборкаДетальные.ЗначениеСтимулирующегоТарифаПороговогоПредыдущее;
							СтрокаУровень3.ЗначениеПорогаПредыдущее = ВыборкаДетальные.ЗначениеПорогаПредыдущее;
							
							СтрокаУровень3.Тариф = ВыборкаДетальные.ЗначениеТарифаПорогового;
							СтрокаУровень3.ТарифСтимулирующий = ВыборкаДетальные.ЗначениеСтимулирующегоТарифаПорогового;
							СтрокаУровень3.ЗначениеПорога = ВыборкаДетальные.ЗначениеПорога;
							
							Если ЭтоНовый Тогда
								СтрокаУровень3.Тариф = СтрокаУровень3.ТарифПредыдущий;
								СтрокаУровень3.ЗначениеПорога = СтрокаУровень3.ЗначениеПорогаПредыдущее;
								СтрокаУровень3.ТарифСтимулирующий = СтрокаУровень3.ТарифСтимулирующийПредыдущий;
							КонецЕсли;
							
							Если ПредПорог = 0 Тогда
								НаимПорога = НСтр("ru='За объем до %1 %2 включительно в месяц';uk='За обсяг до %1 %2 включно на місяць'");
							ИначеЕсли ВыборкаДетальные.ЗначениеПорога < 1000000 Тогда
								НаимПорога = НСтр("ru='За объем свыше %3 %2 до %1 %2 включительно в месяц';uk='За обсяг понад %3 %2 до %1 %2 включно на місяць'");
							Иначе
								НаимПорога = НСтр("ru='За объем свыше %3 %2 в месяц';uk='За обсяг понад %3 %2 на місяць'");
							КонецЕсли;
							
							НаимПорога = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НаимПорога,
							СтрокаУровень3.ЗначениеПорога,
							ВыборкаДетальные.ЕдиницаИзмерения,
							ПредПорог);
							
							СтрокаУровень3.Услуга = НаимПорога;
							
							ПредПорог = СтрокаУровень3.ЗначениеПорога;
							
							ТарифСтр = ТарифСтр + Строка(СтрокаУровень3.Тариф)+"\";
							ТарифСтимулирующийСтр = ТарифСтимулирующийСтр + Строка(СтрокаУровень3.ТарифСтимулирующий)+"\";
							
						КонецЕсли;
						
					КонецЦикла; 
					
					Если НЕ СтрокаУровень2.УслугаСДПТ Тогда
						СтрокаУровень2.Тариф = ТарифСтр;
						СтрокаУровень2.ТарифСтимулирующий = ТарифСтимулирующийСтр;
					КонецЕсли;
					
				КонецЕсли; 
			КонецЦикла;
		КонецЦикла; 
		
	КонецЦикла; 
	
	ЭтаФорма.ЗначениеВРеквизитФормы(Дерево, "ТарифыУслуг");
	
КонецПроцедуры

// Процедура - разворачивает строки дерева.
//
&НаКлиенте
Процедура РазвернутьСтрокиДерева(ДеревоДанных, ПредставлениеНаФорме)
	
	СтрокиДерева = ДеревоДанных.ПолучитьЭлементы();
	
	Для Каждого Строка Из СтрокиДерева Цикл
		
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		ПредставлениеНаФорме.Развернуть(ИдентификаторСтроки, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
	Объект,
	,
	Параметры.ЗначениеКопирования,
	Параметры.Основание,
	СостояниеДокумента,
	КартинкаСостоянияДокумента,
	РазрешеноПроведение,
	ПоследнееИзменение,
	Параметры.ЗначенияЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЭтоНовый = Истина;	
	КонецЕсли;
	
	ИспользоватьУслугиСДПТПодробно = ПолучитьФункциональнуюОпцию("ИспользоватьУслугиСДПТПодробно");
	Если ИспользоватьУслугиСДПТПодробно Тогда
		ПолучитьТаблицуУслугПодробно(Объект.Дата, Объект.Организация, Объект.Здание);
	Иначе	
		ПолучитьТаблицуУслуг(Объект.Дата, Объект.Организация, Объект.Здание);
	КонецЕсли;
	
	УстановитьВидимостьПредыдущихЗначений();
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Тарифы.Очистить();
	Объект.ТарифыУслугПодробно.Очистить();
	Объект.ТарифыПороговые.Очистить();
	
	СтрокиДерева = ТарифыУслуг.ПолучитьЭлементы();
	
	Для Каждого Строка Из СтрокиДерева Цикл
		
		ПолучитьТарифУслуги(Строка);
		
	КонецЦикла;
	
	
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

// Процедура - обработчик события ПриИзменении поля ввода УстанавливатьНаЗдания.
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ИспользоватьУслугиСДПТПодробно Тогда
		ПолучитьТаблицуУслугПодробно(Объект.Дата, Объект.Организация, Объект.Здание);
	Иначе	
		ПолучитьТаблицуУслуг(Объект.Дата, Объект.Организация, Объект.Здание);
	КонецЕсли;
	
	РазвернутьСтрокиДерева(ТарифыУслуг, Элементы.ТарифыУслуг);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "Здание".
//
&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	Если ИспользоватьУслугиСДПТПодробно Тогда
		ПолучитьТаблицуУслугПодробно(Объект.Дата, Объект.Организация, Объект.Здание);
	Иначе	
		ПолучитьТаблицуУслуг(Объект.Дата, Объект.Организация, Объект.Здание);
	КонецЕсли;
	
	РазвернутьСтрокиДерева(ТарифыУслуг, Элементы.ТарифыУслуг);
	
КонецПроцедуры

// Процедура - получает тариф услуги.
//
&НаКлиенте
Процедура ПолучитьТарифУслуги(СтрокаДерева)
	
	Для Каждого ПодчиненнаяСтрока Из СтрокаДерева.ПолучитьЭлементы() Цикл
		
		Если НЕ ПодчиненнаяСтрока.ЭтоГруппа Тогда
			
			Если ТипЗнч(ПодчиненнаяСтрока.Услуга) = Тип("СправочникСсылка.Услуги") Тогда
				НоваяСтрока = Объект.Тарифы.Добавить();
				НоваяСтрока.Услуга = ПодчиненнаяСтрока.Услуга;
				НоваяСтрока.ЗначениеТарифа = ПодчиненнаяСтрока.Тариф;
				НоваяСтрока.ВидТарифа = ПодчиненнаяСтрока.ВидТарифа; 
				НоваяСтрока.НормаПотребления = ПодчиненнаяСтрока.НормаПотребления;
				НоваяСтрока.ЗначениеТарифаПоНорме = ПодчиненнаяСтрока.ТарифПоНорме;
				НоваяСтрока.ЗначениеСтимулирующегоТарифа = ПодчиненнаяСтрока.ТарифСтимулирующий;
				НоваяСтрока.ЗначениеСтимулирующегоТарифаПоНорме = ПодчиненнаяСтрока.ТарифСтимулирующийПоНорме;
				НоваяСтрока.ЗначениеТарифаЛьгота = ПодчиненнаяСтрока.ТарифЛьгота;
				НоваяСтрока.ЗначениеТарифаПоНормеЛьгота = ПодчиненнаяСтрока.ТарифПоНормеЛьгота;
				
			ИначеЕсли ТипЗнч(ПодчиненнаяСтрока.Услуга) = Тип("СправочникСсылка.УслугиСДПТПодробно") Тогда
				НоваяСтрока = Объект.ТарифыУслугПодробно.Добавить();
				НоваяСтрока.Услуга = СтрокаДерева.Услуга;
				НоваяСтрока.УслугаПодробно = ПодчиненнаяСтрока.Услуга;
				НоваяСтрока.ЗначениеТарифа = ПодчиненнаяСтрока.Тариф;
				НоваяСтрока.ЗначениеТарифаЛьгота = ПодчиненнаяСтрока.ТарифЛьгота;
				НоваяСтрока.ВидТарифа = ПодчиненнаяСтрока.ВидТарифа;
				НоваяСтрока.ЗначениеСтимулирующегоТарифа = ПодчиненнаяСтрока.ТарифСтимулирующий;
				
			ИначеЕсли ПодчиненнаяСтрока.ЭтоПорог Тогда
				НоваяСтрока = Объект.ТарифыПороговые.Добавить();
				НоваяСтрока.Услуга = СтрокаДерева.Услуга;
				НоваяСтрока.ЗначениеТарифа = ПодчиненнаяСтрока.Тариф;
				НоваяСтрока.ВидТарифа = СтрокаДерева.ВидТарифа;
				НоваяСтрока.ЗначениеСтимулирующегоТарифа = ПодчиненнаяСтрока.ТарифСтимулирующий;
				НоваяСтрока.Порог = ПодчиненнаяСтрока.Порог;
				НоваяСтрока.ЗначениеПорога = ПодчиненнаяСтрока.ЗначениеПорога;
				
			КонецЕсли;
		КонецЕсли;
		
		Если ПодчиненнаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
			
			ПолучитьТарифУслуги(ПодчиненнаяСтрока);
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОЙ ЧАСТИ ТАРИФЫУСЛУГ

// Процедура - обработчик события ПередНачаломИзменения табличной части "ТарифыУслуг".
//
&НаКлиенте
Процедура ТарифыУслугПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущийЭлемент.Имя = "ТарифыУслугТариф" ИЛИ Элемент.ТекущийЭлемент.Имя = "ТарифыУслугТарифСтимулирующий" или Элемент.ТекущийЭлемент.Имя = "ТарифыУслугТарифЛьгота"  Тогда
		Элемент.ТекущийЭлемент.ДоступныеТипы = Новый ОписаниеТипов("Число");
		Если Элемент.ТекущиеДанные.ЭтоГруппа ИЛИ Элемент.ТекущиеДанные.УслугаСДПТ Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Если Элемент.ТекущийЭлемент.Имя = "ТарифыУслугТарифЛьгота" Тогда
	//	Элемент.ТекущийЭлемент.ДоступныеТипы = Новый ОписаниеТипов("Число");
	//	Если Элемент.ТекущиеДанные.ЭтоГруппа ИЛИ ТипЗнч(Элемент.ТекущиеДанные.Услуга) = Тип("СправочникСсылка.УслугиСДПТПодробно") Тогда
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//
	Если Элемент.ТекущийЭлемент.Имя = "ТарифыУслугНормаПотребления" ИЛИ Элемент.ТекущийЭлемент.Имя = "ТарифыУслугТарифПоНорме" 
		ИЛИ Элемент.ТекущийЭлемент.Имя = "ТарифыУслугТарифСтимулирующийПоНорме" ИЛИ Элемент.ТекущийЭлемент.Имя = "ТарифыУслугТарифПоНормеЛьгота" Тогда
		Отказ = НЕ Элемент.ТекущиеДанные.ПоНормеПотребления;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ТарифыУслугТариф" ИЛИ Элемент.ТекущийЭлемент.Имя = "ТарифыУслугТарифСтимулирующий" Тогда 
		
		Если Элемент.ТекущиеДанные.УслугаПороговая ИЛИ Элемент.ТекущиеДанные.ЭтоПорог Тогда
			Отказ = Истина;
			
			Если Элемент.ТекущиеДанные.ЭтоПорог Тогда
				ТекУслуга = Элемент.ТекущиеДанные.УслугаРодитель;
				ТекВидТарифа = Элемент.ТекущиеДанные.ВидТарифа;
			Иначе
				ТекУслуга = Элемент.ТекущиеДанные.Услуга;
				ТекВидТарифа = Элемент.ТекущиеДанные.ВидТарифа;
			КонецЕсли; 
			
			АдресТаблицыПороговВХранилище = ПоместитьТаблицуПороговВХранилище(ТекУслуга,ТекВидТарифа);
			
			Если АдресТаблицыПороговВХранилище = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			ПараметрыПодбора = Новый Структура(
			"АдресТаблицыПороговВХранилище,
			|Услуга",
			АдресТаблицыПороговВХранилище,
			ТекУслуга
			);
			
			Результат = ОткрытьФормуМодально("ОбщаяФорма.ФормаПороговыхТарифов", ПараметрыПодбора);
			Если Результат = КодВозвратаДиалога.OK Тогда
				
				ПолучитьТаблицуПороговИзХранилище(АдресТаблицыПороговВХранилище, ТекУслуга,ТекВидТарифа);
				
				РазвернутьСтрокиДерева(ТарифыУслуг, Элементы.ТарифыУслуг);
								
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриОкончанииРедактирования табличной части "ТарифыУслуг".
//
&НаКлиенте
Процедура ТарифыУслугПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элемент.ТекущийЭлемент.Имя = "ТарифыУслугТариф" Тогда
		
		Для каждого СтрокаУровень1 Из ТарифыУслуг.ПолучитьЭлементы() Цикл
			Для каждого СтрокаУровень2 Из СтрокаУровень1.ПолучитьЭлементы() Цикл
				ИтогТариф = 0;
				ИтогЛьгота = 0;
				Если СтрокаУровень2.ПолучитьЭлементы().Количество() > 0 Тогда
					Для каждого СтрокаУровень3 Из СтрокаУровень2.ПолучитьЭлементы() Цикл
						ИтогТариф = ИтогТариф + СтрокаУровень3.Тариф;
						Если НЕ ЗначениеЗаполнено(СтрокаУровень3.ТарифЛьгота) тогда
							СтрокаУровень3.ТарифЛьгота = СтрокаУровень3.Тариф;
						КонецЕсли;
						ИтогЛьгота = ИтогЛьгота + СтрокаУровень3.ТарифЛьгота;
					КонецЦикла;
					Если НЕ СтрокаУровень3.ЭтоПорог Тогда
						СтрокаУровень2.Тариф = ИтогТариф;
						Если НЕ ЗначениеЗаполнено(СтрокаУровень2.ТарифЛьгота) тогда
							СтрокаУровень2.ТарифЛьгота = ИтогТариф;
						ИначеЕсли ИтогЛьгота <> СтрокаУровень2.ТарифЛьгота Тогда 
							СтрокаУровень2.ТарифЛьгота = ИтогЛьгота;
						КонецЕсли;	
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ТарифыУслугТарифЛьгота" Тогда
		
		Для каждого СтрокаУровень1 Из ТарифыУслуг.ПолучитьЭлементы() Цикл
			Для каждого СтрокаУровень2 Из СтрокаУровень1.ПолучитьЭлементы() Цикл
				ИтогТариф = 0;
				Если СтрокаУровень2.ПолучитьЭлементы().Количество() > 0 Тогда
					Для каждого СтрокаУровень3 Из СтрокаУровень2.ПолучитьЭлементы() Цикл
						ИтогТариф = ИтогТариф + СтрокаУровень3.ТарифЛьгота;
					КонецЦикла;
					Если НЕ СтрокаУровень3.ЭтоПорог Тогда
						СтрокаУровень2.ТарифЛьгота = ИтогТариф;
						//Если НЕ ЗначениеЗаполнено(СтрокаУровень2.ТарифЛьгота) тогда
						//	СтрокаУровень2.ТарифЛьгота = ИтогТариф;
						//КонецЕсли;	
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ТарифыУслугТарифСтимулирующий" Тогда
		
		Для каждого СтрокаУровень1 Из ТарифыУслуг.ПолучитьЭлементы() Цикл
			Для каждого СтрокаУровень2 Из СтрокаУровень1.ПолучитьЭлементы() Цикл
				ИтогТарифСтимулирующий = 0;
				Если СтрокаУровень2.ПолучитьЭлементы().Количество() > 0 Тогда
					Для каждого СтрокаУровень3 Из СтрокаУровень2.ПолучитьЭлементы() Цикл
						ИтогТарифСтимулирующий = ИтогТарифСтимулирующий + СтрокаУровень3.ТарифСтимулирующий;
					КонецЦикла;
					Если НЕ СтрокаУровень3.ЭтоПорог Тогда
						СтрокаУровень2.ТарифСтимулирующий = ИтогТарифСтимулирующий;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "НормаПотребления" табличной части "ТарифыУслуг".
//
&НаКлиенте
Процедура ТарифыУслугНормаПотребленияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТарифыУслуг.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные.ПоНормеПотребления Тогда
		ТекущиеДанные.НормаПотребления = 0;	
	Иначе
		ТекущиеДанные.ТарифПоНорме = ТекущиеДанные.НормаПотребления * ТекущиеДанные.Тариф;
		ТекущиеДанные.ТарифСтимулирующийПоНорме = ТекущиеДанные.НормаПотребления * ТекущиеДанные.ТарифСтимулирующий;	
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "ТарифПоНорме" табличной части "ТарифыУслуг".
//
&НаКлиенте
Процедура ТарифыУслугТарифПоНормеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТарифыУслуг.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные.ПоНормеПотребления Тогда
		ТекущиеДанные.ТарифПоНорме = 0;	
	КонецЕсли;
	
	Попытка
		ТекущиеДанные.Тариф = ТекущиеДанные.ТарифПоНорме / ТекущиеДанные.НормаПотребления;	
	Исключение
	КонецПопытки;
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "Тариф" табличной части "ТарифыУслуг".
//
&НаКлиенте
Процедура ТарифыУслугТарифПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТарифыУслуг.ТекущиеДанные;
	
	Если ТекущиеДанные.ПоНормеПотребления Тогда
		ТекущиеДанные.ТарифПоНорме = ТекущиеДанные.НормаПотребления * ТекущиеДанные.Тариф;
		ТекущиеДанные.ТарифПоНормеЛьгота = ТекущиеДанные.ТарифПоНорме;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Услуга) = ТИп("СправочникСсылка.УслугиСДПТПодробно") Тогда
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ТарифЛьгота) Тогда
			ТекущиеДанные.ТарифЛьгота = ТекущиеДанные.Тариф;
		КонецЕсли;	
	КонецЕсли;	
	
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "ТарифСтимулирующий" табличной части "ТарифыУслуг".
//
&НаКлиенте
Процедура ТарифыУслугТарифСтимулирующийПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТарифыУслуг.ТекущиеДанные;
	
	Если ТекущиеДанные.ПоНормеПотребления Тогда
		ТекущиеДанные.ТарифСтимулирующийПоНорме = ТекущиеДанные.НормаПотребления * ТекущиеДанные.ТарифСтимулирующий;	
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "ТарифСтимулирующийПоНорме" табличной части "ТарифыУслуг".
//
&НаКлиенте
Процедура ТарифыУслугТарифСтимулирующийПоНормеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТарифыУслуг.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные.ПоНормеПотребления Тогда
		ТекущиеДанные.ТарифСтимулирующийПоНорме = 0;	
	КонецЕсли;
	
	Попытка
		ТекущиеДанные.ТарифСтимулирующий = ТекущиеДанные.ТарифСтимулирующийПоНорме / ТекущиеДанные.НормаПотребления;	
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// Процедура - обработчик команды "ПоказатьПредыдущиеЗначения"
&НаКлиенте
Процедура ПоказатьПредыдущиеЗначения(Команда)
	
	Если ПоказатьПредыдущие Тогда
		ПоказатьПредыдущие = Ложь;
	Иначе
		ПоказатьПредыдущие = Истина;
	КонецЕсли;
	
	УстановитьВидимостьПредыдущихЗначений();
	
	Элементы.ТарифыУслугКнопкаПоказатьПредыдущие.Пометка = ПоказатьПредыдущие;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПредыдущихЗначений()
	
	Элементы.ТарифыУслугГруппаПредыдущиеЗначения.Видимость = ПоказатьПредыдущие;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСтимулирующийТариф") Тогда
		Элементы.ТарифыУслугГруппаСтимулирующийПредыдущий.Видимость = ПоказатьПредыдущие;
	Иначе
		Элементы.ТарифыУслугГруппаСтимулирующийПредыдущий.Видимость = Ложь;
		Элементы.ТарифыУслугГруппаСтимулирующий.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьТаблицуПороговВХранилище(Услуга,ВидТарифа)
	
	Дерево = РеквизитФормыВЗначение("ТарифыУслуг");
	//НайденнаяСтрока = Дерево.Строки.Найти(Услуга, "Услуга", Истина);
	Если ВидТарифа  = Перечисления.ВидыТарифов.ПустаяСсылка() Тогда
		Возврат Неопределено;
	КонецЕсли; 	
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Услуга",Услуга);
	ПараметрыОтбора.Вставить("ВидТарифа",ВидТарифа);
	
	НайденныеСтроки = Дерево.Строки.НайтиСтроки(ПараметрыОтбора,Истина);
	
	//Если Не НайденнаяСтрока = Неопределено Тогда
	Если НайденныеСтроки.Количество() <> 0 тогда
		
		СтрокиПорогов = НайденныеСтроки[0].Строки;
		ТаблицаПорогов = Новый ТаблицаЗначений;
		ТаблицаПорогов.Колонки.Добавить("Порог");
		ТаблицаПорогов.Колонки.Добавить("ЗначениеПорога");
		ТаблицаПорогов.Колонки.Добавить("Тариф");
		ТаблицаПорогов.Колонки.Добавить("ТарифСтимулирующий");
		ТаблицаПорогов.Колонки.Добавить("ВидТарифа");
		
		Для каждого СтрокаПорога Из СтрокиПорогов Цикл
			НоваяСтрока = ТаблицаПорогов.Добавить();
			НоваяСтрока.Порог = СтрокаПорога.Порог;
			НоваяСтрока.ЗначениеПорога = СтрокаПорога.ЗначениеПорога;
			НоваяСтрока.Тариф = СтрокаПорога.Тариф;
			НоваяСтрока.ТарифСтимулирующий = СтрокаПорога.ТарифСтимулирующий;
			НоваяСтрока.ВидТарифа = ВидТарифа;
		КонецЦикла; 
		
		Возврат ПоместитьВоВременноеХранилище(
		ТаблицаПорогов,
		УникальныйИдентификатор
		);
		
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ПолучитьТаблицуПороговИзХранилище(АдресТаблицыПороговВХранилище, Услуга, ВидТарифа)
	
	Дерево = РеквизитФормыВЗначение("ТарифыУслуг");
	//НайденнаяСтрока = Дерево.Строки.Найти(Услуга, "Услуга", Истина);
	
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Услуга",Услуга);
	ПараметрыОтбора.Вставить("ВидТарифа",ВидТарифа);
	
	НайденныеСтроки = Дерево.Строки.НайтиСтроки(ПараметрыОтбора,Истина);
	
	
	//Если Не НайденнаяСтрока = Неопределено Тогда
	Если НайденныеСтроки.Количество() <> 0 тогда
		
		НайденнаяСтрока  = НайденныеСтроки[0];
		
		СтрокиПорогов = НайденнаяСтрока.Строки;
		
		ТаблицаПорогов = ПолучитьИзВременногоХранилища(АдресТаблицыПороговВХранилище);
		
		ТарифСтр = "";
		ТарифСтимулирующийСтр = "";
		ПредПорог = 0;
		Для каждого СтрокаПорога Из СтрокиПорогов Цикл
			СтрокаТаблицы = ТаблицаПорогов.Найти(СтрокаПорога.Порог,"Порог"); 
			Если НЕ СтрокаТаблицы = Неопределено Тогда
				
				СтрокаПорога.ЗначениеПорога = СтрокаТаблицы.ЗначениеПорога;
				СтрокаПорога.Тариф = СтрокаТаблицы.Тариф;
				СтрокаПорога.ТарифСтимулирующий = СтрокаТаблицы.ТарифСтимулирующий;
				СтрокаПорога.Порог = СтрокаТаблицы.Порог;
				
				Если СтрокаПорога.Порог = Перечисления.ПорогиТарифовУслуг.Порог1 Тогда
					НаимПорога = НСтр("ru='За объем до %1 %2 включительно в месяц';uk='За обсяг до %1 %2 включно на місяць'");
				ИначеЕсли СтрокаПорога.ЗначениеПорога < 1000000 Тогда
					НаимПорога = НСтр("ru='За объем свыше %3 %2 до %1 %2 включительно в месяц';uk='За обсяг понад %3 %2 до %1 %2 включно на місяць'");
				Иначе
					НаимПорога = НСтр("ru='За объем свыше %3 %2 в месяц';uk='За обсяг понад %3 %2 на місяць'");
				КонецЕсли;
				
				НаимПорога = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НаимПорога,
				СтрокаПорога.ЗначениеПорога,
				СтрокаПорога.ЕдиницаИзмерения,
				ПредПорог);
				
				СтрокаПорога.Услуга = НаимПорога;
				
				ПредПорог = СтрокаПорога.ЗначениеПорога;
				ТарифСтр = ТарифСтр + Строка(СтрокаТаблицы.Тариф)+"\";
				ТарифСтимулирующийСтр = ТарифСтимулирующийСтр + Строка(СтрокаТаблицы.ТарифСтимулирующий)+"\";
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		НайденнаяСтрока.Тариф = ТарифСтр;
		НайденнаяСтрока.ТарифСтимулирующий = ТарифСтимулирующийСтр;
		
	КонецЕсли; 
	
	ЭтаФорма.ЗначениеВРеквизитФормы(Дерево, "ТарифыУслуг");
	
	Для Каждого СтрокаУровень1 Из ТарифыУслуг.ПолучитьЭлементы() Цикл
		Если СтрокаУровень1.Услуга = Услуга.Родитель Тогда
			Элементы.ТарифыУслуг.ТекущаяСтрока = СтрокаУровень1.ПолучитьЭлементы().Получить(НайденнаяСтрока.Родитель.Строки.Индекс(НайденнаяСтрока)).ПолучитьИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТарифыУслугТарифЛьготаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТарифыУслуг.ТекущиеДанные;
	

	Если  ТекущиеДанные.ТарифЛьгота > ТекущиеДанные.Тариф Тогда
		ТекущиеДанные.ТарифЛьгота = ТекущиеДанные.Тариф;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Тариф льготы не может быть меньше тарифа услуги! Установлен тариф для льготы равный тарифу услуги'; uk = 'Тариф пільги не може бути менше тарифу послуги! Встановлений тариф для пільги рівний тарифу послуги'");
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли;	
		
	Если ТекущиеДанные.ПоНормеПотребления Тогда
		ТекущиеДанные.ТарифПоНормеЛьгота = ТекущиеДанные.ТарифЛьгота * ТекущиеДанные.НормаПотребления;
	КонецЕсли;

КонецПроцедуры
